CSI API ETABS v1
cAnalysisResultsSetup.DeselectAllCasesAndCombosForOutput Method
 Deselects all load cases and response combinations for output.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeselectAllCasesAndCombosForOutput()
Function DeselectAllCasesAndCombosForOutput As Integer
Dim instance As cAnalysisResultsSetup
Dim returnValue As Integer
returnValue = instance.DeselectAllCasesAndCombosForOutput()
int DeselectAllCasesAndCombosForOutput()
abstract DeselectAllCasesAndCombosForOutput : unit -> int
Return Value
Type: Int32
 Returns zero if the cases and combos are successfully deselected; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Selected As Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'check if case is selected
       ret = SapModel.Results.Setup.GetCaseSelectedForOutput("DEAD", Selected)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace